Autodesk.Revit.DB.Structure.AnalyticalMember.FlipCurve
Flip the Analytical Member
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.SetMemberForces(Autodesk.Revit.DB.Structure.MemberForces)
Sets Member Forces to Analytical Member.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
memberForces:
End to which member forces will be added is defined by setting Autodesk::Revit::DB::Structure::MemberForces::Position
property in provided Member Forces object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.SetMemberForces(System.Boolean,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Sets Member Forces to Analytical Member.
Remarks:
If Analytical Member already have member forces defined for that end, newly provided values replace current one.
Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
start:
Member Forces position on Analytical Member. True for start, false for end.
force:
The translational forces at specified position of the element.
The x value of XYZ object represents force along x-axis of the Analytical Member coordinate system, y along y-axis, z along z-axis respectively.
moment:
The rotational forces at specified position of the element.
The x value of XYZ object represents moment about x-axis of the Analytical Member coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.GetMemberForces
Gets the member forces associated with this Analytical Member.
Remarks:
Member forces are strictly related with releases. This means that we can obtain member forces values only for directions that have releases set to false.
Force or moment component on direction that have release set to true is skipped (zeroed) during getting.
Returns:
Returns a collection of Member Forces associated with this Analytical Member. Empty collection will be returned if Analytical Member doesn't have any Member Forces.
To find out with which end member forces are associated use Autodesk::Revit::DB::Structure::MemberForces::Position
property to obtain a position of Member Forces on element.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.SetReleaseConditions(Autodesk.Revit.DB.Structure.ReleaseConditions)
Sets Release Conditions to Analytical Member.
Remarks:
If element already have release conditions defined for that end, newly provided values replace current one.
The ReleaseType will be set to UserDefined.
releaseConditions:
End to which release conditions will be added is defined by setting Autodesk::Revit::DB::Structure::ReleaseConditions::Position
property in provided release conditions object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.GetReleaseConditions
Gets the release conditions associated with this Analytical Member.
Returns:
Returns a collection of Release Conditions associated with this Analytical Member. Empty collection will be returned if Analytical Member doesn't have any Release Conditions.
End to which release conditions will be added is defined by setting Autodesk::Revit::DB::Structure::ReleaseConditions::Position
property in provided release conditions object.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.SetReleaseType(System.Boolean,Autodesk.Revit.DB.Structure.ReleaseType)
Sets the release type.
start:
The position on Analytical Member element. True for start, false for end.
releaseType:
The type of release.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.GetReleaseType(System.Boolean)
Gets the release type.
start:
The position on Analytical Member element. True for start, false for end.
Returns:
The type of release.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.IsValidCurve(Autodesk.Revit.DB.Curve)
Verifies if the curve is valid for an Analytical Member.
curve:
The curve to be verified.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.IsValidSectionTypeId(Autodesk.Revit.DB.ElementId)
Checks whether the family symbol id is allowed for
Analytical Member as Section Type property.
familySymbolId:
Family symbol id which has to be checked.
Returns:
True if %familySymbolId% is invalidElementId; or if it is
the id of a FamilySymbol of category "Structural Framing"
(OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns)
Returns false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.SetCurve(Autodesk.Revit.DB.Curve)
Sets the curve for the Analytical Member.
Remarks:
End nodes connection will be lost if the curve changes position.
The curve must be bounded.
The curve can be:
Line Arc Ellipse
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The provided curve is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve)
Creates a new instance of an Analytical Member within the project.
Remarks:
The curve must be bounded.
The curve can be:
Line Arc Ellipse
aDoc:
A Revit document.
curve:
Curve of the analytical member.
Returns:
The newly created Analytical Member instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The provided curve is not supported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.StructuralSectionShape
The structural section shape of the Analytical Member.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.SectionTypeId
The id of the type from the structural Family assigned to the Analytical Member.
Remarks:
The type must be of category "Structural Framing"
(OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns)
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: sectionTypeId is the id of some element that is not a
FamilySymbol or is not of the category "Structural Framing"
(OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember.CrossSectionRotation
This represents the cross-section rotation, in radians.
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalMember
Represents a linear element in the structural analytical model.
Since:
2023